Store/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Store/src/Enums/ТипНоменклатуры/ТипНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипНоменклатуры</name>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
</mdclass:Enum>

Store/src/Documents/РеализацияТоваров/ObjectModule.bsl
#Область ОбработчикиСобытий

// Формирует движения документа по регистру накопления "Товары" с видом "Расход".
// В регистр записывается только номенклатура с типом "Товар".
// Сумма себестоимости рассчитывается по средней на момент проведения.
//
// Параметры:
//  Отказ - Булево - признак отказа от проведения.
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Отбираем номенклатуру из табличной части документа с типом "Товар"
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Количество КАК Количество
		|ИЗ
		|	Документ.РеализацияТоваров.Товары КАК ТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО СпрНоменклатура.Ссылка = ТЧ.Номенклатура
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|	И СпрНоменклатура.Тип = &ТипТовар";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТипТовар", Перечисления.ТипНоменклатуры.Товар);

	ТоварыДляСписания = Запрос.Выполнить().Выгрузить();

	Если ТоварыДляСписания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	МассивНоменклатуры = ТоварыДляСписания.ВыгрузитьКолонку("Номенклатура");

	// Получаем остатки регистра "Товары" на момент проведения документа
	ЗапросОстатков = Новый Запрос;
	ЗапросОстатков.Текст =
		"ВЫБРАТЬ
		|	ТоварыОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыОстатки.КоличествоОстаток КАК Количество,
		|	ТоварыОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.Товары.Остатки(
		|			&МоментВремени,
		|			Номенклатура В (&МассивНоменклатуры)) КАК ТоварыОстатки";
	ЗапросОстатков.УстановитьПараметр("МоментВремени",
		Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	ЗапросОстатков.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);

	ВыборкаОстатков = ЗапросОстатков.Выполнить().Выбрать();

	СоответствиеСредних = Новый Соответствие;
	Пока ВыборкаОстатков.Следующий() Цикл
		Если ВыборкаОстатков.Количество > 0 Тогда
			СоответствиеСредних.Вставить(
				ВыборкаОстатков.Номенклатура,
				Окр(ВыборкаОстатков.Сумма / ВыборкаОстатков.Количество, 2));
		КонецЕсли;
	КонецЦикла;

	// Формируем движения по регистру "Товары" с видом "Расход"
	Движения.Товары.Записывать = Истина;

	Для Каждого СтрокаТЧ Из ТоварыДляСписания Цикл

		СредняяСумма = 0;
		ЗначениеСредней = СоответствиеСредних.Получить(СтрокаТЧ.Номенклатура);
		Если ЗначениеСредней <> Неопределено Тогда
			СредняяСумма = ЗначениеСредней;
		КонецЕсли;

		Запись = Движения.Товары.Добавить();
		Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
		Запись.Период = Дата;
		Запись.Номенклатура = СтрокаТЧ.Номенклатура;
		Запись.Склад = Склад;
		Запись.Количество = СтрокаТЧ.Количество;
		Запись.Сумма = Окр(СредняяСумма * СтрокаТЧ.Количество, 2);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
